perf/load.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/app'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

# Load test
  phases:
    - name: Ramp
      duration: 300
      arrivalRate: 0
      rampTo: 1000

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'